HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxVadc_bf.h
/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.API2 */
#define IFX_VADC_ACCPROT0_API2_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.API2 */
#define IFX_VADC_ACCPROT0_API2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.API2 */
#define IFX_VADC_ACCPROT0_API2_OFF (18)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.API3 */
#define IFX_VADC_ACCPROT0_API3_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.API3 */
#define IFX_VADC_ACCPROT0_API3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.API3 */
#define IFX_VADC_ACCPROT0_API3_OFF (19)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.API4 */
#define IFX_VADC_ACCPROT0_API4_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.API4 */
#define IFX_VADC_ACCPROT0_API4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.API4 */
#define IFX_VADC_ACCPROT0_API4_OFF (20)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.API5 */
#define IFX_VADC_ACCPROT0_API5_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.API5 */
#define IFX_VADC_ACCPROT0_API5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.API5 */
#define IFX_VADC_ACCPROT0_API5_OFF (21)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.API6 */
#define IFX_VADC_ACCPROT0_API6_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.API6 */
#define IFX_VADC_ACCPROT0_API6_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.API6 */
#define IFX_VADC_ACCPROT0_API6_OFF (22)

/** \\brief  Length for Ifx_VADC_ACCPROT0_Bits.API7 */
#define IFX_VADC_ACCPROT0_API7_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT0_Bits.API7 */
#define IFX_VADC_ACCPROT0_API7_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT0_Bits.API7 */
#define IFX_VADC_ACCPROT0_API7_OFF (23)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR0 */
#define IFX_VADC_ACCPROT1_APR0_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR0 */
#define IFX_VADC_ACCPROT1_APR0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR0 */
#define IFX_VADC_ACCPROT1_APR0_OFF (16)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR1 */
#define IFX_VADC_ACCPROT1_APR1_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR1 */
#define IFX_VADC_ACCPROT1_APR1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR1 */
#define IFX_VADC_ACCPROT1_APR1_OFF (17)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR2 */
#define IFX_VADC_ACCPROT1_APR2_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR2 */
#define IFX_VADC_ACCPROT1_APR2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR2 */
#define IFX_VADC_ACCPROT1_APR2_OFF (18)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR3 */
#define IFX_VADC_ACCPROT1_APR3_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR3 */
#define IFX_VADC_ACCPROT1_APR3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR3 */
#define IFX_VADC_ACCPROT1_APR3_OFF (19)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR4 */
#define IFX_VADC_ACCPROT1_APR4_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR4 */
#define IFX_VADC_ACCPROT1_APR4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR4 */
#define IFX_VADC_ACCPROT1_APR4_OFF (20)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR5 */
#define IFX_VADC_ACCPROT1_APR5_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR5 */
#define IFX_VADC_ACCPROT1_APR5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR5 */
#define IFX_VADC_ACCPROT1_APR5_OFF (21)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR6 */
#define IFX_VADC_ACCPROT1_APR6_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR6 */
#define IFX_VADC_ACCPROT1_APR6_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR6 */
#define IFX_VADC_ACCPROT1_APR6_OFF (22)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APR7 */
#define IFX_VADC_ACCPROT1_APR7_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APR7 */
#define IFX_VADC_ACCPROT1_APR7_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APR7 */
#define IFX_VADC_ACCPROT1_APR7_OFF (23)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS0 */
#define IFX_VADC_ACCPROT1_APS0_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS0 */
#define IFX_VADC_ACCPROT1_APS0_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS0 */
#define IFX_VADC_ACCPROT1_APS0_OFF (0)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS1 */
#define IFX_VADC_ACCPROT1_APS1_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS1 */
#define IFX_VADC_ACCPROT1_APS1_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS1 */
#define IFX_VADC_ACCPROT1_APS1_OFF (1)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS2 */
#define IFX_VADC_ACCPROT1_APS2_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS2 */
#define IFX_VADC_ACCPROT1_APS2_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS2 */
#define IFX_VADC_ACCPROT1_APS2_OFF (2)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS3 */
#define IFX_VADC_ACCPROT1_APS3_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS3 */
#define IFX_VADC_ACCPROT1_APS3_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS3 */
#define IFX_VADC_ACCPROT1_APS3_OFF (3)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS4 */
#define IFX_VADC_ACCPROT1_APS4_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS4 */
#define IFX_VADC_ACCPROT1_APS4_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS4 */
#define IFX_VADC_ACCPROT1_APS4_OFF (4)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS5 */
#define IFX_VADC_ACCPROT1_APS5_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS5 */
#define IFX_VADC_ACCPROT1_APS5_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS5 */
#define IFX_VADC_ACCPROT1_APS5_OFF (5)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS6 */
#define IFX_VADC_ACCPROT1_APS6_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS6 */
#define IFX_VADC_ACCPROT1_APS6_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS6 */
#define IFX_VADC_ACCPROT1_APS6_OFF (6)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APS7 */
#define IFX_VADC_ACCPROT1_APS7_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APS7 */
#define IFX_VADC_ACCPROT1_APS7_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APS7 */
#define IFX_VADC_ACCPROT1_APS7_OFF (7)

/** \\brief  Length for Ifx_VADC_ACCPROT1_Bits.APTF */
#define IFX_VADC_ACCPROT1_APTF_LEN (1)

/** \\brief  Mask for Ifx_VADC_ACCPROT1_Bits.APTF */
#define IFX_VADC_ACCPROT1_APTF_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_ACCPROT1_Bits.APTF */
#define IFX_VADC_ACCPROT1_APTF_OFF (15)

/** \\brief  Length for Ifx_VADC_BRSCTRL_Bits.GTLVL */
#define IFX_VADC_BRSCTRL_GTLVL_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSCTRL_Bits.GTLVL */
#define IFX_VADC_BRSCTRL_GTLVL_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSCTRL_Bits.GTLVL */
#define IFX_VADC_BRSCTRL_GTLVL_OFF (20)

/** \\brief  Length for Ifx_VADC_BRSCTRL_Bits.GTSEL */
#define IFX_VADC_BRSCTRL_GTSEL_LEN (4)

/** \\brief  Mask for Ifx_VADC_BRSCTRL_Bits.GTSEL */
#define IFX_VADC_BRSCTRL_GTSEL_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_BRSCTRL_Bits.GTSEL */
#define IFX_VADC_BRSCTRL_GTSEL_OFF (16)

