HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxVadc_bf.h
/** \\brief  Length for Ifx_VADC_BRSCTRL_Bits.GTWC */
#define IFX_VADC_BRSCTRL_GTWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSCTRL_Bits.GTWC */
#define IFX_VADC_BRSCTRL_GTWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSCTRL_Bits.GTWC */
#define IFX_VADC_BRSCTRL_GTWC_OFF (23)

/** \\brief  Length for Ifx_VADC_BRSCTRL_Bits.SRCRESREG */
#define IFX_VADC_BRSCTRL_SRCRESREG_LEN (4)

/** \\brief  Mask for Ifx_VADC_BRSCTRL_Bits.SRCRESREG */
#define IFX_VADC_BRSCTRL_SRCRESREG_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_BRSCTRL_Bits.SRCRESREG */
#define IFX_VADC_BRSCTRL_SRCRESREG_OFF (0)

/** \\brief  Length for Ifx_VADC_BRSCTRL_Bits.XTLVL */
#define IFX_VADC_BRSCTRL_XTLVL_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSCTRL_Bits.XTLVL */
#define IFX_VADC_BRSCTRL_XTLVL_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSCTRL_Bits.XTLVL */
#define IFX_VADC_BRSCTRL_XTLVL_OFF (12)

/** \\brief  Length for Ifx_VADC_BRSCTRL_Bits.XTMODE */
#define IFX_VADC_BRSCTRL_XTMODE_LEN (2)

/** \\brief  Mask for Ifx_VADC_BRSCTRL_Bits.XTMODE */
#define IFX_VADC_BRSCTRL_XTMODE_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_BRSCTRL_Bits.XTMODE */
#define IFX_VADC_BRSCTRL_XTMODE_OFF (13)

/** \\brief  Length for Ifx_VADC_BRSCTRL_Bits.XTSEL */
#define IFX_VADC_BRSCTRL_XTSEL_LEN (4)

/** \\brief  Mask for Ifx_VADC_BRSCTRL_Bits.XTSEL */
#define IFX_VADC_BRSCTRL_XTSEL_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_BRSCTRL_Bits.XTSEL */
#define IFX_VADC_BRSCTRL_XTSEL_OFF (8)

/** \\brief  Length for Ifx_VADC_BRSCTRL_Bits.XTWC */
#define IFX_VADC_BRSCTRL_XTWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSCTRL_Bits.XTWC */
#define IFX_VADC_BRSCTRL_XTWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSCTRL_Bits.XTWC */
#define IFX_VADC_BRSCTRL_XTWC_OFF (15)

/** \\brief  Length for Ifx_VADC_BRSMR_Bits.CLRPND */
#define IFX_VADC_BRSMR_CLRPND_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSMR_Bits.CLRPND */
#define IFX_VADC_BRSMR_CLRPND_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSMR_Bits.CLRPND */
#define IFX_VADC_BRSMR_CLRPND_OFF (8)

/** \\brief  Length for Ifx_VADC_BRSMR_Bits.ENGT */
#define IFX_VADC_BRSMR_ENGT_LEN (2)

/** \\brief  Mask for Ifx_VADC_BRSMR_Bits.ENGT */
#define IFX_VADC_BRSMR_ENGT_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_BRSMR_Bits.ENGT */
#define IFX_VADC_BRSMR_ENGT_OFF (0)

/** \\brief  Length for Ifx_VADC_BRSMR_Bits.ENSI */
#define IFX_VADC_BRSMR_ENSI_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSMR_Bits.ENSI */
#define IFX_VADC_BRSMR_ENSI_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSMR_Bits.ENSI */
#define IFX_VADC_BRSMR_ENSI_OFF (3)

/** \\brief  Length for Ifx_VADC_BRSMR_Bits.ENTR */
#define IFX_VADC_BRSMR_ENTR_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSMR_Bits.ENTR */
#define IFX_VADC_BRSMR_ENTR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSMR_Bits.ENTR */
#define IFX_VADC_BRSMR_ENTR_OFF (2)

/** \\brief  Length for Ifx_VADC_BRSMR_Bits.LDEV */
#define IFX_VADC_BRSMR_LDEV_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSMR_Bits.LDEV */
#define IFX_VADC_BRSMR_LDEV_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSMR_Bits.LDEV */
#define IFX_VADC_BRSMR_LDEV_OFF (9)

/** \\brief  Length for Ifx_VADC_BRSMR_Bits.LDM */
#define IFX_VADC_BRSMR_LDM_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSMR_Bits.LDM */
#define IFX_VADC_BRSMR_LDM_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSMR_Bits.LDM */
#define IFX_VADC_BRSMR_LDM_OFF (5)

/** \\brief  Length for Ifx_VADC_BRSMR_Bits.REQGT */
#define IFX_VADC_BRSMR_REQGT_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSMR_Bits.REQGT */
#define IFX_VADC_BRSMR_REQGT_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSMR_Bits.REQGT */
#define IFX_VADC_BRSMR_REQGT_OFF (7)

/** \\brief  Length for Ifx_VADC_BRSMR_Bits.RPTDIS */
#define IFX_VADC_BRSMR_RPTDIS_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSMR_Bits.RPTDIS */
#define IFX_VADC_BRSMR_RPTDIS_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSMR_Bits.RPTDIS */
#define IFX_VADC_BRSMR_RPTDIS_OFF (16)

/** \\brief  Length for Ifx_VADC_BRSMR_Bits.SCAN */
#define IFX_VADC_BRSMR_SCAN_LEN (1)

/** \\brief  Mask for Ifx_VADC_BRSMR_Bits.SCAN */
#define IFX_VADC_BRSMR_SCAN_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_BRSMR_Bits.SCAN */
#define IFX_VADC_BRSMR_SCAN_OFF (4)

/** \\brief  Length for Ifx_VADC_BRSPND_Bits.CHPNDGy */
#define IFX_VADC_BRSPND_CHPNDGY_LEN (32)

/** \\brief  Mask for Ifx_VADC_BRSPND_Bits.CHPNDGy */
#define IFX_VADC_BRSPND_CHPNDGY_MSK (0xffffffff)

/** \\brief  Offset for Ifx_VADC_BRSPND_Bits.CHPNDGy */
#define IFX_VADC_BRSPND_CHPNDGY_OFF (0)

/** \\brief  Length for Ifx_VADC_BRSSEL_Bits.CHSELGy */
#define IFX_VADC_BRSSEL_CHSELGY_LEN (32)

/** \\brief  Mask for Ifx_VADC_BRSSEL_Bits.CHSELGy */
#define IFX_VADC_BRSSEL_CHSELGY_MSK (0xffffffff)

/** \\brief  Offset for Ifx_VADC_BRSSEL_Bits.CHSELGy */
#define IFX_VADC_BRSSEL_CHSELGY_OFF (0)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.BNDSELL */
#define IFX_VADC_CHCTR_BNDSELL_LEN (2)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.BNDSELL */
#define IFX_VADC_CHCTR_BNDSELL_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.BNDSELL */
#define IFX_VADC_CHCTR_BNDSELL_OFF (4)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.BNDSELU */
#define IFX_VADC_CHCTR_BNDSELU_LEN (2)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.BNDSELU */
#define IFX_VADC_CHCTR_BNDSELU_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.BNDSELU */
#define IFX_VADC_CHCTR_BNDSELU_OFF (6)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.BNDSELX */
#define IFX_VADC_CHCTR_BNDSELX_LEN (4)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.BNDSELX */
#define IFX_VADC_CHCTR_BNDSELX_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.BNDSELX */
#define IFX_VADC_CHCTR_BNDSELX_OFF (12)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.BWDCH */
#define IFX_VADC_CHCTR_BWDCH_LEN (2)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.BWDCH */
#define IFX_VADC_CHCTR_BWDCH_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_CHCTR_Bits.BWDCH */
#define IFX_VADC_CHCTR_BWDCH_OFF (28)

/** \\brief  Length for Ifx_VADC_CHCTR_Bits.BWDEN */
#define IFX_VADC_CHCTR_BWDEN_LEN (1)

/** \\brief  Mask for Ifx_VADC_CHCTR_Bits.BWDEN */
#define IFX_VADC_CHCTR_BWDEN_MSK (0x1)

