HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxVadc_bf.h
/** \\brief  Mask for Ifx_VADC_RES_Bits.RESULT */
#define IFX_VADC_RES_RESULT_MSK (0xffff)

/** \\brief  Offset for Ifx_VADC_RES_Bits.RESULT */
#define IFX_VADC_RES_RESULT_OFF (0)

/** \\brief  Length for Ifx_VADC_RES_Bits.VF */
#define IFX_VADC_RES_VF_LEN (1)

/** \\brief  Mask for Ifx_VADC_RES_Bits.VF */
#define IFX_VADC_RES_VF_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_RES_Bits.VF */
#define IFX_VADC_RES_VF_OFF (31)

/** \\brief  Length for Ifx_VADC_RESD_Bits.CHNR */
#define IFX_VADC_RESD_CHNR_LEN (5)

/** \\brief  Mask for Ifx_VADC_RESD_Bits.CHNR */
#define IFX_VADC_RESD_CHNR_MSK (0x1f)

/** \\brief  Offset for Ifx_VADC_RESD_Bits.CHNR */
#define IFX_VADC_RESD_CHNR_OFF (20)

/** \\brief  Length for Ifx_VADC_RESD_Bits.CRS */
#define IFX_VADC_RESD_CRS_LEN (2)

/** \\brief  Mask for Ifx_VADC_RESD_Bits.CRS */
#define IFX_VADC_RESD_CRS_MSK (0x3)

/** \\brief  Offset for Ifx_VADC_RESD_Bits.CRS */
#define IFX_VADC_RESD_CRS_OFF (28)

/** \\brief  Length for Ifx_VADC_RESD_Bits.DRC */
#define IFX_VADC_RESD_DRC_LEN (4)

/** \\brief  Mask for Ifx_VADC_RESD_Bits.DRC */
#define IFX_VADC_RESD_DRC_MSK (0xf)

/** \\brief  Offset for Ifx_VADC_RESD_Bits.DRC */
#define IFX_VADC_RESD_DRC_OFF (16)

/** \\brief  Length for Ifx_VADC_RESD_Bits.EMUX */
#define IFX_VADC_RESD_EMUX_LEN (3)

/** \\brief  Mask for Ifx_VADC_RESD_Bits.EMUX */
#define IFX_VADC_RESD_EMUX_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_RESD_Bits.EMUX */
#define IFX_VADC_RESD_EMUX_OFF (25)

/** \\brief  Length for Ifx_VADC_RESD_Bits.FCR */
#define IFX_VADC_RESD_FCR_LEN (1)

/** \\brief  Mask for Ifx_VADC_RESD_Bits.FCR */
#define IFX_VADC_RESD_FCR_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_RESD_Bits.FCR */
#define IFX_VADC_RESD_FCR_OFF (30)

/** \\brief  Length for Ifx_VADC_RESD_Bits.RESULT */
#define IFX_VADC_RESD_RESULT_LEN (16)

/** \\brief  Mask for Ifx_VADC_RESD_Bits.RESULT */
#define IFX_VADC_RESD_RESULT_MSK (0xffff)

/** \\brief  Offset for Ifx_VADC_RESD_Bits.RESULT */
#define IFX_VADC_RESD_RESULT_OFF (0)

/** \\brief  Length for Ifx_VADC_RESD_Bits.VF */
#define IFX_VADC_RESD_VF_LEN (1)

/** \\brief  Mask for Ifx_VADC_RESD_Bits.VF */
#define IFX_VADC_RESD_VF_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_RESD_Bits.VF */
#define IFX_VADC_RESD_VF_OFF (31)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.ARCDIS */
#define IFX_VADC_SHS_CALCTR_ARCDIS_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.ARCDIS */
#define IFX_VADC_SHS_CALCTR_ARCDIS_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.ARCDIS */
#define IFX_VADC_SHS_CALCTR_ARCDIS_OFF (2)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.ARCH */
#define IFX_VADC_SHS_CALCTR_ARCH_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.ARCH */
#define IFX_VADC_SHS_CALCTR_ARCH_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.ARCH */
#define IFX_VADC_SHS_CALCTR_ARCH_OFF (3)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.AREFDEF */
#define IFX_VADC_SHS_CALCTR_AREFDEF_LEN (3)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.AREFDEF */
#define IFX_VADC_SHS_CALCTR_AREFDEF_MSK (0x7)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.AREFDEF */
#define IFX_VADC_SHS_CALCTR_AREFDEF_OFF (4)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.ARM */
#define IFX_VADC_SHS_CALCTR_ARM_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.ARM */
#define IFX_VADC_SHS_CALCTR_ARM_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.ARM */
#define IFX_VADC_SHS_CALCTR_ARM_OFF (7)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.CALGNSTC */
#define IFX_VADC_SHS_CALCTR_CALGNSTC_LEN (6)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.CALGNSTC */
#define IFX_VADC_SHS_CALCTR_CALGNSTC_MSK (0x3f)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.CALGNSTC */
#define IFX_VADC_SHS_CALCTR_CALGNSTC_OFF (8)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.CALMAX */
#define IFX_VADC_SHS_CALCTR_CALMAX_LEN (6)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.CALMAX */
#define IFX_VADC_SHS_CALCTR_CALMAX_MSK (0x3f)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.CALMAX */
#define IFX_VADC_SHS_CALCTR_CALMAX_OFF (24)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.CALORD */
#define IFX_VADC_SHS_CALCTR_CALORD_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.CALORD */
#define IFX_VADC_SHS_CALCTR_CALORD_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.CALORD */
#define IFX_VADC_SHS_CALCTR_CALORD_OFF (0)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.SUCAL */
#define IFX_VADC_SHS_CALCTR_SUCAL_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.SUCAL */
#define IFX_VADC_SHS_CALCTR_SUCAL_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.SUCAL */
#define IFX_VADC_SHS_CALCTR_SUCAL_OFF (31)

/** \\brief  Length for Ifx_VADC_SHS_CALCTR_Bits.SUCALVAL */
#define IFX_VADC_SHS_CALCTR_SUCALVAL_LEN (7)

/** \\brief  Mask for Ifx_VADC_SHS_CALCTR_Bits.SUCALVAL */
#define IFX_VADC_SHS_CALCTR_SUCALVAL_MSK (0x7f)

/** \\brief  Offset for Ifx_VADC_SHS_CALCTR_Bits.SUCALVAL */
#define IFX_VADC_SHS_CALCTR_SUCALVAL_OFF (16)

/** \\brief  Length for Ifx_VADC_SHS_CALGC_Bits.CALGNVALA */
#define IFX_VADC_SHS_CALGC_CALGNVALA_LEN (14)

/** \\brief  Mask for Ifx_VADC_SHS_CALGC_Bits.CALGNVALA */
#define IFX_VADC_SHS_CALGC_CALGNVALA_MSK (0x3fff)

/** \\brief  Offset for Ifx_VADC_SHS_CALGC_Bits.CALGNVALA */
#define IFX_VADC_SHS_CALGC_CALGNVALA_OFF (16)

/** \\brief  Length for Ifx_VADC_SHS_CALGC_Bits.CALGNVALS */
#define IFX_VADC_SHS_CALGC_CALGNVALS_LEN (14)

/** \\brief  Mask for Ifx_VADC_SHS_CALGC_Bits.CALGNVALS */
#define IFX_VADC_SHS_CALGC_CALGNVALS_MSK (0x3fff)

/** \\brief  Offset for Ifx_VADC_SHS_CALGC_Bits.CALGNVALS */
#define IFX_VADC_SHS_CALGC_CALGNVALS_OFF (0)

/** \\brief  Length for Ifx_VADC_SHS_CALGC_Bits.GNAWC */
#define IFX_VADC_SHS_CALGC_GNAWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALGC_Bits.GNAWC */
#define IFX_VADC_SHS_CALGC_GNAWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALGC_Bits.GNAWC */
#define IFX_VADC_SHS_CALGC_GNAWC_OFF (31)

/** \\brief  Length for Ifx_VADC_SHS_CALGC_Bits.GNSWC */
#define IFX_VADC_SHS_CALGC_GNSWC_LEN (1)

/** \\brief  Mask for Ifx_VADC_SHS_CALGC_Bits.GNSWC */
#define IFX_VADC_SHS_CALGC_GNSWC_MSK (0x1)

/** \\brief  Offset for Ifx_VADC_SHS_CALGC_Bits.GNSWC */
#define IFX_VADC_SHS_CALGC_GNSWC_OFF (15)

/** \\brief  Length for Ifx_VADC_SHS_CALOC_Bits.CALOFFVAL0 */
#define IFX_VADC_SHS_CALOC_CALOFFVAL0_LEN (7)

/** \\brief  Mask for Ifx_VADC_SHS_CALOC_Bits.CALOFFVAL0 */
#define IFX_VADC_SHS_CALOC_CALOFFVAL0_MSK (0x7f)

